# IEntryPoint Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IEntryPoint Properties
IEntryPoint Interface See Also
---
The IEntryPoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddinFolder |

# See Also
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace